Aquawhite/LM3S5R31-TwinWeigher/New Twin Weigher V1.0.c
//V1.1      17 March 2016 , trying to build initialization program
//V1.0		FEB 2016
// 			Every mm is 0.01mm per unit (eg. RTServoPosmm = 100 means 1mm)

#include "inc/hw_types.h"
#include "inc/hw_ints.h"
#include "inc/hw_memmap.h"
#include "inc/hw_gpio.h"
#include "inc/hw_ssi.h"
#include "driverlib/interrupt.h"
#include "driverlib/sysctl.h"
#include "driverlib/rom.h"
#include "driverlib/gpio.h"
#include "driverlib/uart.h"
#include "driverlib/ssi.h"
#include "driverlib/adc.h"
#include "driverlib/timer.h"
#include "driverlib/i2c.h"
#include "driverlib/pwm.h"
#include "driverlib/qei.h"

#define TRUE	1
#define FALSE	0

#define FORWARD 1
#define BACKWARD 0

#define UNUSED 0

//*****************************************************************************
// Defines for the pins that are used in the device
//*****************************************************************************

// Button PIN Mapping

#define PIN_RX_BASE					GPIO_PORTA_BASE
#define PIN_RX_PIN					GPIO_PIN_0
#define PORT_TX_BASE				GPIO_PORTA_BASE
#define PORT_TX_PIN					GPIO_PIN_1
#define PORT_SSI_CLK_BASE			GPIO_PORTA_BASE
#define PORT_SSI_CLK_PIN			GPIO_PIN_2
#define PORT_SSI_FSS_BASE			GPIO_PORTA_BASE
#define PORT_SSI_FSS_PIN			GPIO_PIN_3
#define PIN_SSI_RX_BASE				GPIO_PORTA_BASE
#define PIN_SSI_RX_PIN				GPIO_PIN_4
#define PORT_SSI_TX_BASE			GPIO_PORTA_BASE
#define PORT_SSI_TX_PIN				GPIO_PIN_5
#define PORT_W_LSMGATEPNEU_VALVE_BASE	GPIO_PORTA_BASE
#define PORT_W_LSMGATEPNEU_VALVE_PIN	GPIO_PIN_6
#define PORT_W_LLRGATEPNEU_VALVE_BASE	GPIO_PORTA_BASE
#define PORT_W_LLRGATEPNEU_VALVE_PIN	GPIO_PIN_7

#define PIN_W_RHOPPER_SENS_BASE			GPIO_PORTB_BASE			// Not 5V Tolerant , Max 3.6 V
#define PIN_W_RHOPPER_SENS_PIN			GPIO_PIN_0
#define PIN_W_LHOPPER_SENS_BASE			GPIO_PORTB_BASE			// Not 5V Tolerant , Max 3.6 V
#define PIN_W_LHOPPER_SENS_PIN			GPIO_PIN_1
#define PORT_EX1_BASE					GPIO_PORTB_BASE
#define PORT_EX1_PIN					GPIO_PIN_2
#define PIN_EXSENS3_BASE				GPIO_PORTB_BASE
#define PIN_EXSENS3_PIN					GPIO_PIN_3
#define PIN_HEATER_ERROR_BASE			GPIO_PORTB_BASE
#define PIN_HEATER_ERROR_PIN			GPIO_PIN_4
#define PIN_HOPPER_SENSOR_BASE			GPIO_PORTB_BASE
#define PIN_HOPPER_SENSOR_PIN			GPIO_PIN_5
#define PIN_AIR_ERROR_BASE				GPIO_PORTB_BASE
#define PIN_AIR_ERROR_PIN				GPIO_PIN_6
#define PIN_BTN_RUN_BASE				GPIO_PORTB_BASE
#define PIN_BTN_RUN_PIN					GPIO_PIN_7

#define PORT_TCK_BASE					GPIO_PORTC_BASE
#define PORT_TCK_PIN					GPIO_PIN_0
#define PORT_TMS_BASE					GPIO_PORTC_BASE
#define PORT_TMS_PIN					GPIO_PIN_1
#define PIN_TDI_BASE					GPIO_PORTC_BASE
#define PIN_TDI_PIN						GPIO_PIN_2
#define PORT_TDO_BASE					GPIO_PORTC_BASE
#define PORT_TDO_PIN					GPIO_PIN_3
#define PORT_OF_VACUUM_BASE				GPIO_PORTC_BASE
#define PORT_OF_VACUUM_PIN				GPIO_PIN_4
#define PORT_OF_OPENPNEU_VALVE_BASE				GPIO_PORTC_BASE
#define PORT_OF_OPENPNEU_VALVE_PIN				GPIO_PIN_5
#define PORT_OF_ENGAGEPNEU_VALVE_BASE			GPIO_PORTC_BASE
#define PORT_OF_ENGAGEPNEU_VALVE_PIN			GPIO_PIN_6
#define PORT_OF_GATEPNEU_VALVE_BASE			GPIO_PORTC_BASE
#define PORT_OF_GATEPNEU_VALVE_PIN			GPIO_PIN_7

#define PORT_W_LCR_SCL_BASE			GPIO_PORTD_BASE
#define PORT_W_LCR_SCL_PIN			GPIO_PIN_0
#define PIN_W_LCR_DATA_BASE			GPIO_PORTD_BASE
#define PIN_W_LCR_DATA_PIN			GPIO_PIN_1
#define PIN_EXSENS4_BASE			GPIO_PORTD_BASE
#define PIN_EXSENS4_PIN				GPIO_PIN_2
#define PIN_TR_VACUUM_SENS_BASE			GPIO_PORTD_BASE
#define PIN_TR_VACUUM_SENS_PIN			GPIO_PIN_3
#define PIN_OF_ROPENPNEU_EXTSENS_BASE		GPIO_PORTD_BASE
#define PIN_OF_ROPENPNEU_EXTSENS_PIN		GPIO_PIN_4
#define PIN_OF_ROPENPNEU_RETSENS_BASE			GPIO_PORTD_BASE
#define PIN_OF_ROPENPNEU_RETSENS_PIN			GPIO_PIN_5
#define PIN_OF_ENGAGEPNEU_RETSENS_BASE			GPIO_PORTD_BASE					// WARNING MOVED TEMPORARY
#define PIN_OF_ENGAGEPNEU_RETSENS_PIN			GPIO_PIN_6
#define PIN_OF_ENGAGEPNEU_EXTSENS_BASE			GPIO_PORTD_BASE
#define PIN_OF_ENGAGEPNEU_EXTSENS_PIN			GPIO_PIN_7

#define PORT_EX2_BASE						GPIO_PORTE_BASE
#define PORT_EX2_PIN						GPIO_PIN_0
#define PORT_DATECODE_BASE					GPIO_PORTE_BASE
#define PORT_DATECODE_PIN					GPIO_PIN_1
#define PIN_OF_LOPENPNEU_EXTSENS_BASE		GPIO_PORTE_BASE
#define PIN_OF_LOPENPNEU_EXTSENS_PIN			GPIO_PIN_2
#define PIN_OF_LOPENPNEU_RETSENS_BASE		GPIO_PORTE_BASE
#define	PIN_OF_LOPENPNEU_RETSENS_PIN			GPIO_PIN_3
#define PIN_W_LCL_DATA_BASE					GPIO_PORTE_BASE
#define PIN_W_LCL_DATA_PIN					GPIO_PIN_4
#define PORT_W_LCL_SCL_BASE					GPIO_PORTE_BASE
#define	PORT_W_LCL_SCL_PIN					GPIO_PIN_5
#define PIN_OF_GATEPNEU_EXTSENS_BASE			GPIO_PORTE_BASE
#define PIN_OF_GATEPNEU_EXTSENS_PIN			GPIO_PIN_6
#define PIN_OF_GATEPNEU_RETSENS_BASE			GPIO_PORTE_BASE
#define	PIN_OF_GATEPNEU_RETSENS_PIN			GPIO_PIN_7

#define PIN_OF_VACUUM_SENSOR_BASE			GPIO_PORTF_BASE
#define PIN_OF_VACUUM_SENSOR_PIN				GPIO_PIN_0
#define	PIN_SP_SEALERPNEU_EXTSENS_BASE		GPIO_PORTF_BASE				//VLVCUTTER
#define PIN_SP_SEALERPNEU_EXTSENS_PIN		GPIO_PIN_1
#define PIN_SP_SEALERPNEU_RETSENS_BASE		GPIO_PORTF_BASE				// Gusset Module
#define PIN_SP_SEALERPNEU_RETSENS_PIN		GPIO_PIN_2
#define PORT_SP_SEALERPNEU_VALVE_BASE		GPIO_PORTF_BASE
#define PORT_SP_SEALERPNEU_VALVE_PIN			GPIO_PIN_3
#define PORT_W_RLRGATEPNEU_VALVE_BASE		GPIO_PORTF_BASE				// WARNING, PROBLEM IN 5R31
#define PORT_W_RLRGATEPNEU_VALVE_PIN		GPIO_PIN_4					// Solved! Changed to PF7 for 5R31
#define PORT_W_LOPGATEPNEU_VALVE_BASE		GPIO_PORTF_BASE				// WARNING, PROBLEM IN 5R31
#define PORT_W_LOPGATEPNEU_VALVE_PIN		GPIO_PIN_5					// Solved! Changed to PG4 for 5R31

#define PORT_TR_EXTPNEU_VALVE_BASE			GPIO_PORTG_BASE
#define PORT_TR_EXTPNEU_VALVE_PIN			GPIO_PIN_0
#define PORT_TR_REOPNEU_VALVE_BASE		GPIO_PORTG_BASE
#define PORT_TR_REOPNEU_VALVE_PIN		GPIO_PIN_1
#define PORT_W_RSMGATEPNEU_VALVE_BASE		GPIO_PORTG_BASE
#define PORT_W_RSMGATEPNEU_VALVE_PIN		GPIO_PIN_7

#define PIN_TR_EXTPNEU_EXTSENS_BASE		GPIO_PORTH_BASE
#define PIN_TR_EXTPNEU_EXTSENS_PIN		GPIO_PIN_0
#define PIN_TR_EXTPNEU_RETSENS_BASE		GPIO_PORTH_BASE
#define	PIN_TR_EXTPNEU_RETSENS_PIN  	GPIO_PIN_1
#define PIN_TR_REOPNEU_RETSENS_BASE		GPIO_PORTH_BASE
#define PIN_TR_REOPNEU_RETSENS_PIN		GPIO_PIN_2
#define PIN_TR_REOPNEU_EXTSENS_BASE		GPIO_PORTH_BASE
#define PIN_TR_REOPNEU_EXTSENS_PIN		GPIO_PIN_3
#define PIN_DATECODE_SENSOR_BASE			GPIO_PORTH_BASE				//Used for checking position
#define PIN_DATECODE_SENSOR_PIN				GPIO_PIN_4
#define PIN_EXSENS2_BASE					GPIO_PORTH_BASE				//VLVROLL
#define PIN_EXSENS2_PIN						GPIO_PIN_5
#define PIN_EXSENS1_BASE					GPIO_PORTH_BASE				//VLVBLOW
#define PIN_EXSENS1_PIN						GPIO_PIN_6
#define PORT_TR_VACUUM_BASE		GPIO_PORTH_BASE
#define PORT_TR_VACUUM_PIN		GPIO_PIN_7

