Aquawhite/LM3S5R31-TwinWeigher/New Twin Weigher V1.0.c
unsigned char OFRequestFilling;

/* Sealing Module & Vibrator Sealer Module */
unsigned int SPSealerPneuRetSensor, SPSealerPneuExtSensor, SPVibEngagePneuRetSensor, SPVibEngagePneuExtSensor;
unsigned int SPPusherPneuRetSensor, SPPusherPneuExtSensor;

unsigned char SPSealerPneuValve, SPSealerPneuValveMON, SPVibEngagePneuValve, SPVibEngagePneuValveMON;
unsigned char SPPusherValve, SPPusherValveMON, SPVibrator, SPVibratorMON;

unsigned int SPSealerPneuValveDuration,	SPSealerPneuValveDelay, SPSealerPneuValveDurationCounter, SPSealerPneuValveDelayCounter;
unsigned char SPModuleStep;

unsigned char SPSbsMON, LastSPSbsMON, SPModMON, LastSPModMON;

/* Weigher Module */
unsigned int LHopperSensor, RHopperSensor;

unsigned char WLLrGatePneuValve, WLLrGatePneuValveMON, WLSmGatePneuValve, WLSmGatePneuValveMON;
unsigned char WLOpGatePneuValve, WLOpGatePneuValveMON, WRLrGatePneuValve, WRLrGatePneuValveMON;
unsigned char WRSmGatePneuValve, WRSmGatePneuValveMON, WROpGatePneuValve, WROpGatePneuValveMON;

unsigned int WLOpGatePneuDuration, WROpGatePneuDuration, WNextOpGateDelay;
unsigned int WLOpGatePneuDurationCounter, WROpGatePneuDurationCounter, WNextOpGateDelayCounter;
signed long int WLCLSDARatioCustomKg, WLCRSDARatioCustomKg, WLCLSDAReadingOffset, WLCRSDAReadingOffset;
signed long int WLCLSDARatioCustomKgCO, WLCRSDARatioCustomKgCO, WLCLSDAReadingOffsetCO, WLCRSDAReadingOffsetCO;
signed long int WLCLDispWeight, WLCRDispWeight, WLCLSDAReading, WLCRSDAReading;

signed long int WLCLSDAReadingCustomKg, WLCLSDAReadingAverage, WLCLSDAReadingZero, WLCLSDAReadingTemp;
signed long int WLCLSDAReadingBuffer[32];
unsigned char WLCLCalibrationMode, WLCLSDAAverageCounter, WLCLLoadSampling = 1, WLCLWaitingMode;
unsigned char WLCLSCLCounter;

signed long int WLCRSDAReadingCustomKg, WLCRSDAReadingAverage, WLCRSDAReadingZero, WLCRSDAReadingTemp;
signed long int WLCRSDAReadingBuffer[32];
unsigned char WLCRCalibrationMode, WLCRSDAAverageCounter, WLCRLoadSampling = 1, WLCRWaitingMode;
unsigned char WLCRSCLCounter;

signed int WLCLTargetWeight, WLCRTargetWeight, WLCLCorrectionWeight, WLCRCorrectionWeight;
signed int WLCLSlowAt, WLCRSlowAt;
unsigned long int WCustomKg;
unsigned char WLCLOnZeroingBtn, WLCROnZeroingBtn, LastWLCLOnZeroingBtn, LastWLCROnZeroingBtn;
unsigned char WLCLCalibrationFlag, WLCRCalibrationFlag, WLCLCalibrationFlagCounter, WLCRCalibrationFlagCounter;

unsigned char WLCLOnZeroingBtn, WLCROnZeroingBtn, WLCLWeightOK, WLCRWeightOK;
unsigned char WLCLWeightOKFlag, WLCRWeightOKFlag, WLCLWeightOKCounter, WLCRWeightOKCounter;

signed long int WLCLTempReading, WLCLSDAReadingNormalised, WLCRTempReading, WLCRSDAReadingNormalised;
unsigned char i;

/* External Heater Module */
unsigned int HeaterErrorCounter, HeaterErrorMsgDuration;
unsigned char HeaterError, HeaterErrorMsg;
//*****************************************************************************
// Interrupt handler for the SSI0 interrupt
//*****************************************************************************
void IntSSI0(void)
{
	SSIIntClear(SSI0_BASE, SSI_TXFF | SSI_RXFF | SSI_RXTO | SSI_RXOR );
	SSIDataGetNonBlocking(SSI0_BASE, &SPIIn[SPICounter]);//SPIIn[SPICounter] = SPDR;
	//PORTSS = TRUE;
	switch(SPICounter)
	{
		case 0:
			if(SPIIn[0] != 0xF0)
			{
				SPICounter = 0;
				SPICounterSkip = TRUE;
				SPIComErrorFlag = TRUE;
			}
		break;
		case 1:
			if(SPIIn[1] != 0x64)
			{
				SPICounter = 0;
				SPICounterSkip = TRUE;
				SPIComErrorFlag = TRUE;
			}
			break;
		case 2:
			if(SPIIn[2] != 0x04)
			{
				SPICounter = 0;
				SPICounterSkip = TRUE;
				SPIComErrorFlag = TRUE;
			}
			break;
		case 24:
			if(SPIIn[24] != 0x0F)
			{
				SPICounter = 0;
				SPICounterSkip = TRUE;
				SPIComErrorFlag = TRUE;
			}
			break;
		case 25:
			if(SPIIn[25] != 0x0F)
			{
				SPICounter = 0;
				SPICounterSkip = TRUE;
				SPIComErrorFlag = TRUE;
			}
	}

	if(SPICounter >= 25)                              // SPI Communication has read all the frame successfully
	{
		SPIComErrorFlag = FALSE;

		ITTrayPosLeftSensor =        	SPIIn[3] % 2;
		ITTrayPosRightSensor =       	(SPIIn[3] >> 1) % 2;
		ITTrayElevationMaxSensor =      (SPIIn[3] >> 2) % 2;
		ITTrayElevationMinSensor =      (SPIIn[3] >> 3) % 2;
		ITMaterialAvailableSensor =     (SPIIn[3] >> 4) % 2;

		GTInFillGripPneuLRetSensor 	=   SPIIn[4] % 2;
		GTInFillGripPneuRRetSensor 	=   (SPIIn[4] >> 1) % 2;
		GTOutFillOpenPneuLRetSensor	=   (SPIIn[4] >> 2) % 2;
		GTOutFillOpenPneuRRetSensor	=   (SPIIn[4] >> 3) % 2;
		GTOutFillOpenPneuLExtSensor	=   (SPIIn[4] >> 4) % 2;
		GTOutFillOpenPneuRExtSensor	=   (SPIIn[4] >> 5) % 2;
		GTOutFillGripPneuLRetSensor	=   (SPIIn[4] >> 6) % 2;
		GTOutFillGripPneuRRetSensor	=   (SPIIn[4] >> 7) % 2;
		GTTransferPneuRetSensor		=   SPIIn[5] % 2;
		GTTransferPneuExtSensor		=   (SPIIn[5] >> 1) % 2;

		VFVibEngagePneuRetSensor	=   SPIIn[6] % 2;
		VFVibEngagePneuExtSensor	=   (SPIIn[6] >> 1) % 2;

		SPVibEngagePneuRetSensor	=   SPIIn[7] % 2;
		SPVibEngagePneuExtSensor	=   (SPIIn[7] >> 1) % 2;
		SPPusherPneuRetSensor		=   (SPIIn[7] >> 2) % 2;
		SPPusherPneuExtSensor		=   (SPIIn[7] >> 3) % 2;

		SlavePortA = SPIIn[8];
		SlavePortB = SPIIn[9];
		SlavePortC = SPIIn[10];
		SlavePortD = SPIIn[11];
		SlavePortE = SPIIn[12];
		SlavePortF = SPIIn[13];
		SlavePortG = SPIIn[14];
		SlavePortH = SPIIn[15];
		SlavePortI = SPIIn[16];
		SlavePortJ = SPIIn[17];

		SPICounter = 0;
		SPICounterSkip = TRUE;
		SPIDataLock = FALSE;
	}

	if(SPICounterSkip)
		SPICounterSkip = FALSE;
	else
		SPICounter++;

	SPITransmitted = FALSE;
}

//*****************************************************************************
// Interrupt handler for the UART0 interrupt
//*****************************************************************************
void UART0IntHandler(void)
{
    unsigned long ulStatus;

    // Get the interrupt status.
    ulStatus = ROM_UARTIntStatus(UART0_BASE, true);

    // Clear the asserted interrupts.
    ROM_UARTIntClear(UART0_BASE, ulStatus);

    // Loop while there are characters in the receive FIFO.
    if( (ulStatus & UART_INT_RX) == UART_INT_RX )
    {
		if(ROM_UARTCharsAvail(UART0_BASE))
		{
			if(!ReadACK)
			{
				ComIN[dataRXIndex] = ROM_UARTCharGetNonBlocking(UART0_BASE);
	            switch(dataRXIndex)
	            {
	                case 0:                                         // 0x0F
	                    break;
	                case 1:             // station number
	                    if(ComIN[1] != 0x01)
	                        dataRXIndex = 0;
	                    break;
	                case 2:             // function number
	                    if(ComIN[2] != 0x03)
	                        dataRXIndex = 0;
	                    break;
	                case 3:
	                    ComAddress = ComIN[3];
	                    break;
	                case 4:
	                    BytestoRead = ComIN[4];
	                    break;
	                case 5:             // Vibrator Counter Setting
	                    if(ComAddress == 1)
	                    {
	                    	if(!MachineRunning)
	                    	{
								ServiceMode = 				ComIN[5] % 2;
								ITMotorTrayElevatorMON =    (ComIN[5] >> 1) % 2;
								ITMotorTrayElevatorDirMON = (ComIN[5] >> 2) % 2;                                          // Vibrator ON/OFF
								ITValveTrayPosMON =   		(ComIN[5] >> 3) % 2;
								TRExtenderPneuValveMON =    (ComIN[5] >> 4) % 2;
								TRReorientPneuValveMON =    (ComIN[5] >> 5) % 2;
								TRVacuumValveMON = 			(ComIN[5] >> 6) % 2;
								TRFoilPusherValveMON = 		(ComIN[5] >> 7) % 2;
	                    	}
	                    }
	                    break;
	                case 6:
	                    if(ComAddress == 1)
	                    {
	                        if(!MachineRunning)
	                    	{
	                        	GTInFillGripPneuValveMON =	ComIN[6] % 2;
	                        	GTOutFillOpenPneuValveMON = (ComIN[6] >> 1) % 2;
	                        	GTOutFillGripPneuValveMON = (ComIN[6] >> 2) % 2;
	                        	GTTransferPneuValveMON =    (ComIN[6] >> 3) % 2;
	                        	OFGatePneuValveMON =     	(ComIN[6] >> 4) % 2;
	                        	OFEngagePneuValveMON =     	(ComIN[6] >> 5) % 2;
	                        	OFOpenPneuValveMON = 		(ComIN[6] >> 6) % 2;
	                        	OFVacuumValveMON  = 		(ComIN[6] >> 7) % 2;
	                        }
	                    }
	                    break;
	                case 7:
	                    if(ComAddress == 1)
	                    {
	                        if(!MachineRunning)
	                    	{
	                        	VFVibEngagePneuValveMON =  	ComIN[7] % 2;
	                        	VFVibratorMON = 			(ComIN[7] >> 1) % 2;
	                        	SPSealerPneuValveMON =   	(ComIN[7] >> 2) % 2;
	                        	SPVibEngagePneuValveMON = 	(ComIN[7] >> 3) % 2;
	                        	SPPusherValveMON = 			(ComIN[7] >> 4) % 2;
	                        	SPVibratorMON = 			(ComIN[7] >> 5) % 2;
	                        	WLLrGatePneuValveMON = 		(ComIN[7] >> 6) % 2;
	                        	WLSmGatePneuValveMON = 		(ComIN[7] >> 7) % 2;
	                        }
	                    }
	                    break;
	                case 8:
	                    if(ComAddress == 1)
	                    {
	                    	WLOpGatePneuValveMON = 	ComIN[8] % 2;
	                    	WRLrGatePneuValveMON =	(ComIN[8] >> 1) % 2;                                          // Vibrator ON/OFF
	                    	WRSmGatePneuValveMON = 	(ComIN[8] >> 2) % 2;
	                    	WROpGatePneuValveMON = 	(ComIN[8] >> 3) % 2;
	                    	//RunBtn = 				(ComIN[8] >> 4) % 2;
	                    	//StopBtn =				(ComIN[8] >> 5) % 2;
	                    	if( LastWLCLOnZeroingBtn != ((ComIN[8] >> 6) % 2) )
	                    		WLCLOnZeroingBtn =		(ComIN[8] >> 6) % 2;
	                    	LastWLCLOnZeroingBtn = (ComIN[8] >> 6) % 2;

