Aquawhite/LM3S5R31-TwinWeigher/New Twin Weigher V1.0.c
    }
    /* Coiling to PORT */

    /* Coiling to PIN */
	//	INPUT WITH BUFFER
    // Infeed Table **IN SLAVE**

    // Buttons
    if(LastRunBtn != !ROM_GPIOPinRead(PIN_BTN_RUN_BASE, PIN_BTN_RUN_PIN))
    	RunBtn = !ROM_GPIOPinRead(PIN_BTN_RUN_BASE, PIN_BTN_RUN_PIN);
    LastRunBtn = !ROM_GPIOPinRead(PIN_BTN_RUN_BASE, PIN_BTN_RUN_PIN);

    if(LastStopBtn != !ROM_GPIOPinRead(PIN_BTN_STOP_BASE, PIN_BTN_STOP_PIN))
    	StopBtn = !ROM_GPIOPinRead(PIN_BTN_STOP_BASE, PIN_BTN_STOP_PIN);
    LastStopBtn = !ROM_GPIOPinRead(PIN_BTN_STOP_BASE, PIN_BTN_STOP_PIN);
	// Transfer & Reorient
	if(!ROM_GPIOPinRead(PIN_TR_EXTPNEU_EXTSENS_BASE, PIN_TR_EXTPNEU_EXTSENS_PIN))
	{
		if(TRExtenderPneuExtSensor)
			TRExtenderPneuExtSensor--;
	}
	else
		TRExtenderPneuExtSensor = BufferSensor;
    if(!ROM_GPIOPinRead(PIN_TR_EXTPNEU_RETSENS_BASE, PIN_TR_EXTPNEU_RETSENS_PIN))
	{
		if(TRExtenderPneuRetSensor)
			TRExtenderPneuRetSensor--;
	}
	else
		TRExtenderPneuRetSensor = BufferSensor;
	if(!ROM_GPIOPinRead(PIN_TR_REOPNEU_EXTSENS_BASE, PIN_TR_REOPNEU_EXTSENS_PIN))
	{
		if(TRReorientPneuExtSensor)
			TRReorientPneuExtSensor--;
	}
	else
		TRReorientPneuExtSensor = BufferSensor;
	if(!ROM_GPIOPinRead(PIN_TR_REOPNEU_RETSENS_BASE, PIN_TR_REOPNEU_RETSENS_PIN))
	{
		if(TRReorientPneuRetSensor)
			TRReorientPneuRetSensor--;
	}
	else
		TRReorientPneuRetSensor = BufferSensor;
	if(!ROM_GPIOPinRead(PIN_TR_VACUUM_SENS_BASE, PIN_TR_VACUUM_SENS_PIN))
	{
		if(TRVacuumSensor)
			TRVacuumSensor--;
	}
	else
		TRVacuumSensor = BufferSensor;

	// Grip & Transfer ** IN SLAVE

	// Filling , Vibrator Filling IN SLAVE
	if(!ROM_GPIOPinRead(PIN_OF_GATEPNEU_EXTSENS_BASE, PIN_OF_GATEPNEU_EXTSENS_PIN))
	{
		if(OFGatePneuExtSensor)
			OFGatePneuExtSensor--;
	}
	else
		OFGatePneuExtSensor = BufferSensor;
    if(!ROM_GPIOPinRead(PIN_OF_GATEPNEU_RETSENS_BASE, PIN_OF_GATEPNEU_RETSENS_PIN))
	{
		if(OFGatePneuRetSensor)
			OFGatePneuRetSensor--;
	}
	else
		OFGatePneuRetSensor = BufferSensor;
	if(!ROM_GPIOPinRead(PIN_OF_ENGAGEPNEU_EXTSENS_BASE, PIN_OF_ENGAGEPNEU_EXTSENS_PIN))
	{
		if(OFEngagePneuExtSensor)
			OFEngagePneuExtSensor--;
	}
	else
		OFEngagePneuExtSensor = BufferSensor;
	if(!ROM_GPIOPinRead(PIN_OF_ENGAGEPNEU_RETSENS_BASE, PIN_OF_ENGAGEPNEU_RETSENS_PIN))
	{
		if(OFEngagePneuRetSensor)
			OFEngagePneuRetSensor--;
	}
	else
		OFEngagePneuRetSensor = BufferSensor;
	if(!ROM_GPIOPinRead(PIN_OF_LOPENPNEU_EXTSENS_BASE, PIN_OF_LOPENPNEU_EXTSENS_PIN))
	{
		if(OFOpenPneuLExtSensor)
			OFOpenPneuLExtSensor--;
	}
	else
		OFOpenPneuLExtSensor = BufferSensor;
	if(!ROM_GPIOPinRead(PIN_OF_ROPENPNEU_EXTSENS_BASE, PIN_OF_ROPENPNEU_EXTSENS_PIN))
	{
		if(OFOpenPneuRExtSensor)
			OFOpenPneuRExtSensor--;
	}
	else
		OFOpenPneuRExtSensor = BufferSensor;
    if(!ROM_GPIOPinRead(PIN_OF_LOPENPNEU_RETSENS_BASE, PIN_OF_LOPENPNEU_RETSENS_PIN))
	{
		if(OFOpenPneuLRetSensor)
			OFOpenPneuLRetSensor--;
	}
	else
		OFOpenPneuLRetSensor = BufferSensor;
	if(!ROM_GPIOPinRead(PIN_OF_ROPENPNEU_RETSENS_BASE, PIN_OF_ROPENPNEU_RETSENS_PIN))
	{
		if(OFOpenPneuRRetSensor)
			OFOpenPneuRRetSensor--;
	}
	else
		OFOpenPneuRRetSensor = BufferSensor;
	if(!ROM_GPIOPinRead(PIN_OF_VACUUM_SENSOR_BASE, PIN_OF_VACUUM_SENSOR_PIN))
	{
		if(OFVacuumSensor)
			OFVacuumSensor--;
	}
	else
		OFVacuumSensor = BufferSensor;

	// Sealing, Vibrator Sealer IN SLAVE
	if(!ROM_GPIOPinRead(PIN_SP_SEALERPNEU_EXTSENS_BASE, PIN_SP_SEALERPNEU_EXTSENS_PIN))
	{
		if(SPSealerPneuExtSensor)
			SPSealerPneuExtSensor--;
	}
	else
		SPSealerPneuExtSensor = BufferSensor;
    if(!ROM_GPIOPinRead(PIN_SP_SEALERPNEU_RETSENS_BASE, PIN_SP_SEALERPNEU_RETSENS_PIN))
	{
		if(SPSealerPneuRetSensor)
			SPSealerPneuRetSensor--;
	}
	else
		SPSealerPneuRetSensor = BufferSensor;

	// Weigher
	if(!ROM_GPIOPinRead(PIN_W_LHOPPER_SENS_BASE, PIN_W_LHOPPER_SENS_PIN))
	{
		if(LHopperSensor)
			LHopperSensor--;
	}
	else
		LHopperSensor = BufferSensor;
	if(!ROM_GPIOPinRead(PIN_W_RHOPPER_SENS_BASE, PIN_W_RHOPPER_SENS_PIN))
	{
		if(RHopperSensor)
			RHopperSensor--;
	}
	else
		RHopperSensor = BufferSensor;

    /* Coiling to PIN */
    if(blinkFlag)
    {
        if(blinkON)
            blinkON--;
        else
        {
            blinkOFF = 400;
            blinkFlag = FALSE;
        }

    }
    else
    {
        if(blinkOFF)
            blinkOFF--;
        else
        {
            blinkON = 400;
            blinkFlag = TRUE;
        }
    }

	/* Infeed Table Module v */
    // IT = Infeed Table
    if(ITEnable || MachineRunning)
    {
    	if(!ITSwitchTrayStep)
    	{
			//Check if material available on current condition
			if(!ITMaterialAvailableSensor)
			{
				// if material is sensed
				ITReady = TRUE;
				ITMotorTrayElevator = FALSE;
			}
			else
			{
				ITReady = FALSE;
				if(ITTrayElevationMaxSensor)	// if position not max
				{
					ITMotorTrayElevatorDir = DirUP;
					ITMotorTrayElevator = TRUE;
				}
				else
				{
					ITSwitchTrayStep = 1;
				}
			}
    	}
    	else
    	{
    		switch(ITSwitchTrayStep)
    		{
    			case 1:
    				ITMotorTrayElevatorDir = DirDOWN;
    				ITMotorTrayElevator = TRUE;
    				if(!ITTrayElevationMinSensor)
    				{
    					ITSwitchTrayStep = 2;
    				}
    				break;
    			case 2:
    				ITMotorTrayElevator = FALSE;
    				if(!ITTrayPosLeftSensor)
    				{
    					if(!ITTrayElevationMinSensor)
    						ITValveTrayPos = TRUE;
    					ITSwitchTrayStep = 3;
    				}
    				if(!ITTrayPosRightSensor)
    				{
    					if(!ITTrayElevationMinSensor)
    						ITValveTrayPos = FALSE;
    					ITSwitchTrayStep = 3;
    				}
    				break;
    			case 3:
    				if(ITValveTrayPos)
    					if(!ITTrayPosRightSensor)
    						ITSwitchTrayStep = 0;
    				if(!ITValveTrayPos)
    					if(!ITTrayPosLeftSensor)
    						ITSwitchTrayStep = 0;
    				break;
    		}
    	}
    }

	/* Transfer & Reorient Module v */
    if(MachineRunning || TRSbsMode || TRModMode || TRInitting)
    {
		switch(TRModuleStep)
		{
			case 0:  // Standby
				TRExtenderPneuValve = FALSE;
				TRReorientPneuValve = FALSE;
				TRVacuumValve		= FALSE;
				//TRFoilPusherValve	= TRUE;

				if( (MachineRunning) && (!MachineStopping) || TRInitting )
				{
					if( (!TRExtenderPneuRetSensor) && (!TRReorientPneuRetSensor) )
					{
						if(!TRSbsMode)
							TRModuleStep = 1;
						else
							TRSbsMode = FALSE;

						if(TRInittingTOCounter)
						{
							TRInittingTOCounter = 0;
							TRInitError -= 1;
						}
					}
					else
					{
						if(TRInitting)
						{
							if(!TRInittingTOCounter)
							{
								TRInittingTOCounter = InittingTO;
								TRInitError += 1;
							}
						}
					}
				}
				break;
			case 1:	// Extend the Extender Pneu , about to get foil
				if(ITReady || TRInitting)
				{
					TRExtenderPneuValve = TRUE;		// get vacuum to touch foil
					TRReorientPneuValve = FALSE;
					TRVacuumValve		= FALSE;
					//TRFoilPusherValve	= TRUE;
					if(!TRExtenderPneuExtSensor)
					{
						if(!TRSbsMode)
							TRModuleStep = 2;
						else
							TRSbsMode = FALSE;

						if(TRInittingTOCounter)
						{
							TRInittingTOCounter = 0;
							TRInitError -= 2;
						}
					}
					else
					{
						if(TRInitting)
						{
							if(!TRInittingTOCounter)
							{
								TRInittingTOCounter = InittingTO;
								TRInitError += 2;
							}
						}
					}
				}
				break;
			case 2:	// Vacuum ON and TRFoilPusher retracts, vacuum the foil
				TRExtenderPneuValve = TRUE;
				TRReorientPneuValve = FALSE;
				TRVacuumValve		= TRUE;
				//TRFoilPusherValve	= FALSE;
				if(!TRVacuumValveDelayCounter)
				{
					if(!TRInitting)
						TRVacuumValveDelayCounter = TRVacuumValveDelay + 1;

					if(!TRSbsMode)
						TRModuleStep = 3;
					else
						TRSbsMode = FALSE;
				}
				break;
			case 3: // Retract the extender, raise the foil
				if(!TRVacuumValveDelayCounter)
				{
					TRExtenderPneuValve = FALSE;
					TRReorientPneuValve = FALSE;
					TRVacuumValve		= TRUE;
					//TRFoilPusherValve	= FALSE;
					if(!TRExtenderPneuRetSensor)
					{
						if(!TRSbsMode)
							TRModuleStep = 4;
						else
							TRSbsMode = FALSE;

						if(TRInittingTOCounter)
						{
							TRInittingTOCounter = 0;
							TRInitError -= 4;
						}
					}
					else
					{
						if(TRInitting)
						{
							if(!TRInittingTOCounter)
							{
								TRInittingTOCounter = InittingTO;
								TRInitError += 4;
							}
						}
					}
				}
				break;
			case 4: // Transfer & Reorient, go to in-fill gripper
				TRExtenderPneuValve = FALSE;
				TRReorientPneuValve = TRUE;
				TRVacuumValve		= TRUE;
				//TRFoilPusherValve	= FALSE;
				if(!TRReorientPneuExtSensor)
				{
					if(!TRSbsMode)
						TRModuleStep = 5;
					else
						TRSbsMode = FALSE;

					TRModuleWaiting = TRUE;

					if(TRInittingTOCounter)
					{
						TRInittingTOCounter = 0;
						TRInitError -= 8;
					}
				}
				else
				{
					if(TRInitting)
					{
						if(!TRInittingTOCounter)
						{
							TRInittingTOCounter = InittingTO;
							TRInitError += 8;
						}
					}
				}
				break;
			case 5: //	Waiting for in-fill gripper to take over foil
				if( (!TRModuleWaiting) || MachineStopping || TRInitting)
					TRModuleStep = 6;
				break;
			case 6:	// Shut down vacuum before moving
				TRExtenderPneuValve = FALSE;
				TRReorientPneuValve = TRUE;
				TRVacuumValve		= FALSE;
				//TRFoilPusherValve	= FALSE;
				if( (!TRVacuumValveDelayCounter) && (!TRInitting) )
					TRVacuumValveDelayCounter = TRVacuumValveDelay + 1;

				if(!TRSbsMode)
					TRModuleStep = 7;
				else
					TRSbsMode = FALSE;

				break;
			case 7: // After delay
				if(!TRVacuumValveDelayCounter)
				{
					TRModuleStep = 0;
					// Step 0
					TRExtenderPneuValve = FALSE;
					TRReorientPneuValve = FALSE;
					TRVacuumValve		= FALSE;
					TRModMode = FALSE;
					TRInitting = FALSE;
				}
				break;
		}
    }

	if(TRVacuumValveDelayCounter)
		TRVacuumValveDelayCounter--;
	if(TRInittingTOCounter)
	{
		TRInittingTOCounter--;
		if(!TRInittingTOCounter)
			TRModuleStep++;
	}
	/* Transfer & Reorient Module ^ */

	/* Grip & Transfer Module v */
	if(MachineRunning || GTSbsMode || GTModMode || GTInitting)
	{
		switch(GTModuleStep)
		{
			case 0:  // Standby
				GTFPushPneuValve = FALSE;
				GTInFillGripPneuValve = TRUE;	// Grip Open
				GTTransferPneuValve = FALSE;

				GTOutFillOpenPneuValve = FALSE;
				GTOutFillGripPneuValve = TRUE;	// Grip Open

				if( (MachineRunning && (!MachineStopping)) || GTInitting )
				{	// no Open Gripper Delay.. maybe need later after trial
					if( (!GTOutFillOpenPneuLRetSensor) && (!GTOutFillOpenPneuRRetSensor) && (!GTTransferPneuRetSensor) )
					{
						if(!GTSbsMode)
							GTModuleStep = 1;
						else
							GTSbsMode = FALSE;

						if(GTInittingTOCounter)
						{
							GTInittingTOCounter = 0;
							GTInitError -= 1;
						}
					}
					else
					{
						if(GTInitting)
						{
							if(!GTInittingTOCounter)
							{
								GTInittingTOCounter = InittingTO;
								GTInitError += 1;
							}
						}
					}
				}
				break;
			case 1:  // SA1 : Receive the foil from TR (Activate foil pusher), SA2 Initiate Filling Process
				// SA 1 Close grip because the foil is already in position by TR Module
				GTTransferPneuValve = FALSE;
				if( TRModuleWaiting && (!GTInitting) )
				{
					GTFPushPneuValve = TRUE;
					GTFPushPneuValveDurationCounter = GTFPushPneuValveDuration;
				}
				// SA 2 Close grip because the foil is already in position by F Module
				if(OFModuleWaiting || GTFirstCycle || GTInitting)
				{
					GTOutFillOpenPneuValve = FALSE;
					GTOutFillGripPneuValve = FALSE;	// Grip Closed
				}

				if(((!GTOutFillGripPneuLRetSensor) && (!GTOutFillGripPneuRRetSensor) && (GTFPushPneuValve || GTInitting)) || MachineStopping)
				{
					if(MachineStopping)
					{
						GTFPushPneuValve = FALSE;
						GTFPushPneuValveDurationCounter = 0;
					}
					if(!GTSbsMode)
						GTModuleStep = 2;
					else
						GTSbsMode = FALSE;

					if(GTInittingTOCounter)
					{
						GTInittingTOCounter = 0;
						GTInitError -= 2;
					}
				}
				else
				{
					if(GTInitting)
					{
						if(!GTInittingTOCounter)
						{
							GTInittingTOCounter = InittingTO;
							GTInitError += 2;
						}
					}
				}
				break;

			case 2:	// SA 1 After PushPneuDelay, Activate Gripper
				//SA 2  Open the bag

				GTTransferPneuValve = FALSE;

				// SA 1 After PushPneuDelay, Activate Gripper
				if(!GTFPushPneuValveDurationCounter)
				GTInFillGripPneuValve = FALSE;	// Grip Closed

				if((!GTInFillGripPneuLRetSensor) && (!GTInFillGripPneuRRetSensor))
				{
					GTFPushPneuValve = FALSE;
					// Move TR Module Waiting after Transfer Pneu been done
					if(TRModuleWaiting)
					{
						TRVacuumValve	= FALSE;
					}
				}

				// SA 2 Initiating opening the bag
				GTOutFillOpenPneuValve = TRUE;	// Open the bag
				GTOutFillGripPneuValve = FALSE;	// Grip Still Closed
				if((!GTOutFillOpenPneuLExtSensor) && (!GTOutFillOpenPneuRExtSensor) && (!GTFPushPneuValve))
				{
					OFModuleWaiting = FALSE;
					if(!GTSbsMode)
						GTModuleStep = 3;
					else
						GTSbsMode = FALSE;

					if(GTInittingTOCounter)
					{
						GTInittingTOCounter = 0;
						GTInitError -= 4;
					}
				}
				else
				{
					if(GTInitting)
					{
						if(!GTInittingTOCounter)
						{
							GTInittingTOCounter = InittingTO;
							GTInitError += 4;
						}
					}
				}
				break;
			case 3:  // SA1 : Receive the foil from TR, SA2 Filling Process
				// SA 1
				// Waiting for SA2 to finish

				// SA 2 // Open the bag
				GTOutFillOpenPneuValve = TRUE;	// Open the bag
				GTOutFillGripPneuValve = FALSE;	// Grip Still Closed
				if((!GTOutFillOpenPneuLExtSensor) && (!GTOutFillOpenPneuRExtSensor))
				{
					if(!GTSbsMode)
						GTModuleStep = 4;
					else
						GTSbsMode = FALSE;

					if(GTInittingTOCounter)
					{
						GTInittingTOCounter = 0;
						GTInitError -= 8;
					}
				}
				else
				{
					if(GTInitting)
					{
						if(!GTInittingTOCounter)
						{
							GTInittingTOCounter = InittingTO;
							GTInitError += 8;
						}
					}
				}
				break;
			case 4:  // SA1 : Receive the foil from TR, SA2 Filling Process
				// SA 1
				// Waiting for SA2 to finish

