Aquawhite/LM3S5R31-TwinWeigher/New Twin Weigher V1.0.c
				// SA 2 // Request Filling and wait till Filling finished
				// Skip Filling if First Cycle
				if(!GTFirstCycle)
					GTRequestFilling = TRUE;

				if(!GTSbsMode)
					GTModuleStep = 5;
				else
					GTSbsMode = FALSE;
				break;
			case 5:  // SA1 : Receive the foil from TR, SA2 Filling Process
				// SA 1
				// Waiting for SA2 to finish

				// SA2 Close the bag after filling
				GTOutFillGripPneuValve = FALSE;	// Grip Still Closed
				if( (!GTRequestFilling) || GTInitting )
				{
					//GTOutFillOpenPneuValve = FALSE;	// Close the bag after filling.. need delay
					if(!GTCloseBagDelayCounter)
						GTCloseBagDelayCounter = GTCloseBagDelay + 1;
				}
				if((!GTOutFillOpenPneuLRetSensor) && (!GTOutFillOpenPneuRRetSensor))
				{
					if(!GTSbsMode)
						GTModuleStep = 6;
					else
						GTSbsMode = FALSE;

					if(GTInittingTOCounter)
					{
						GTInittingTOCounter = 0;
						GTInitError -= 16;
					}
				}
				else
				{
					if(GTInitting)
					{
						if(!GTInittingTOCounter)
						{
							GTInittingTOCounter = InittingTO;
							GTInitError += 16;
						}
					}
				}
				break;
			case 6:	// SA1 & SA2 change position.. TransferPneu Activated
				GTInFillGripPneuValve = FALSE;	// Grip Closed
				GTOutFillOpenPneuValve = FALSE; // Bag Closed
				GTOutFillGripPneuValve = FALSE;	// Grip Closed
				GTTransferPneuValve = TRUE;		// Shift Arm 1 go to filling position
				if(!GTTransferPneuExtSensor)
				{
					GTSA1ModuleWaiting = TRUE;
					GTSA2ModuleWaiting = TRUE;
					// Moved from GTModule = 2 v
					if(TRModuleWaiting)
					{
						TRModuleWaiting = FALSE;
					}
					// Moved from GTModule = 2 ^
					if(!GTSbsMode)
						GTModuleStep = 7;
					else
						GTSbsMode = FALSE;

					if(GTInittingTOCounter)
					{
						GTInittingTOCounter = 0;
						GTInitError -= 32;
					}
				}
				else
				{
					if(GTInitting)
					{
						if(!GTInittingTOCounter)
						{
							GTInittingTOCounter = InittingTO;
							GTInitError += 32;
						}
					}
				}
				break;
			case 7:
				// SA1 : Wait til FModule grab the foil with vacuum

				GTInFillGripPneuValve = FALSE;	// Grip still  Closed

				// SA2 : Wait till SModule Seal the bag..

				GTOutFillOpenPneuValve = FALSE; // Bag Closed
				GTOutFillGripPneuValve = FALSE;	// Grip still  Closed

				if( ((!GTSA1ModuleWaiting) && (!GTSA2ModuleWaiting)) || MachineStopping || GTInitting )
				{
					if(!GTSbsMode)
						GTModuleStep = 8;
					else
						GTSbsMode = FALSE;
				}
				break;
			case 8:
				// SA1 : Open the gripper
				GTInFillGripPneuValve = TRUE;	// Grip Open

				// SA2 : Open the gripper
				GTOutFillOpenPneuValve = FALSE; // Bag Closed
				GTOutFillGripPneuValve = TRUE;	// Grip Open

				GTBothOpenGripDelayCounter = GTBothOpenGripDelay + 1;

				if(!GTSbsMode)
					GTModuleStep = 9;
				else
					GTSbsMode = FALSE;
				break;
			case 9:
				if((!GTSbsMode) || GTModMode)
					GTFirstCycle = FALSE;
				if(!GTBothOpenGripDelayCounter)
				{
					GTModuleStep = 0;
					// Step 0
					GTFPushPneuValve = FALSE;
					GTInFillGripPneuValve = TRUE;	// Grip Open
					GTTransferPneuValve = FALSE;

					GTOutFillOpenPneuValve = FALSE;
					GTOutFillGripPneuValve = TRUE;	// Grip Open

					GTModMode = FALSE;
					GTInitting = FALSE;
				}
				break;
		}
	}

	if(GTFPushPneuValveDurationCounter)
		GTFPushPneuValveDurationCounter--;

	if(GTCloseBagDelayCounter)
	{
		GTCloseBagDelayCounter--;
		if(!GTCloseBagDelayCounter)
			GTOutFillOpenPneuValve = FALSE;  // Close Bag
	}

	if(GTBothOpenGripDelayCounter)
		GTBothOpenGripDelayCounter--;

	if(GTInittingTOCounter)
	{
		GTInittingTOCounter--;
		if(!GTInittingTOCounter)
			GTModuleStep++;
	}
	/* Grip & Transfer Module ^ */

	/* Filling Module v */
	if(MachineRunning || OFSbsMode || OFModMode || OFInitting)
	{
		switch(OFModuleStep)
		{
			case 0: // Standby
				OFGatePneuValve	= FALSE;
				OFEngagePneuValve = FALSE;
				OFOpenPneuValve = FALSE;
				OFVacuumValve = FALSE;
				VFVibEngagePneuValve = FALSE;
				VFVibrator = FALSE;

				if((MachineRunning && (!MachineStopping)) || OFInitting )
				{
					if( (!OFGatePneuRetSensor) && (!OFEngagePneuRetSensor) && (!OFOpenPneuRRetSensor) && (!OFOpenPneuLRetSensor) && (!VFVibEngagePneuRetSensor) )
					{
						if(!OFSbsMode)
							OFModuleStep = 1;
						else
							OFSbsMode = FALSE;

						if(OFInittingTOCounter)
						{
							OFInittingTOCounter = 0;
							OFInitError -= 1;
						}
					}
					else
					{
						if(OFInitting)
						{
							if(!OFInittingTOCounter)
							{
								OFInittingTOCounter = InittingTO;
								OFInitError += 1;
							}
						}
					}
				}
				break;
			case 1: // Receiving from GTModule, Extend the engage and open pneu to locate vacuum into position
				if(GTSA1ModuleWaiting || MachineStopping || OFInitting)
				{
					OFGatePneuValve	= FALSE;
					OFEngagePneuValve = TRUE;
					OFOpenPneuValve = TRUE;
					OFVacuumValve = FALSE;
					VFVibEngagePneuValve = FALSE;
					VFVibrator = FALSE;
					if((!OFEngagePneuExtSensor) && (!OFOpenPneuRExtSensor) && (!OFOpenPneuLExtSensor))
					{
						if(!OFSbsMode)
							OFModuleStep = 2;
						else
							OFSbsMode = FALSE;

						if(OFInittingTOCounter)
						{
							OFInittingTOCounter = 0;
							OFInitError -= 2;
						}
					}
					else
					{
						if(OFInitting)
						{
							if(!OFInittingTOCounter)
							{
								OFInittingTOCounter = InittingTO;
								OFInitError += 2;
							}
						}
					}
				}
				break;
			case 2:	// Activate Vacuum
				OFGatePneuValve	= FALSE;
				OFEngagePneuValve = TRUE;
				OFOpenPneuValve = TRUE;
				OFVacuumValve = TRUE;
				VFVibEngagePneuValve = FALSE;
				VFVibrator = FALSE;
				if(!OFVacuumValveDelayCounter)
				{
					OFVacuumValveDelayCounter = OFVacuumValveDelay + 1;
					if(!OFSbsMode)
						OFModuleStep = 3;
					else
						OFSbsMode = FALSE;
				}
				break;
			case 3:	// Vacuum is sure in effect now
				if(!OFVacuumValveDelayCounter)
				{
					GTSA1ModuleWaiting = FALSE;
					OFModuleWaiting = TRUE;

					if(!OFSbsMode)
						OFModuleStep = 4;
					else
					OFSbsMode = FALSE;
					// GTSA2 GRIP HERE
				}
				break;
			case 4:	// Open the bag (Step 1)& Ready the vibrator
				if((!OFModuleWaiting) || MachineStopping || OFInitting)
				{
					OFGatePneuValve	= FALSE;
					OFEngagePneuValve = TRUE;
					OFOpenPneuValve = FALSE;		// Open the bag
					OFVacuumValve = TRUE;
					VFVibEngagePneuValve = TRUE;	// Engage the Vibrator
					VFVibrator = FALSE;
					if( (!OFOpenPneuRRetSensor) && (!OFOpenPneuLRetSensor))
					{
						if(!OFSbsMode)
							OFModuleStep = 5;
						else
							OFSbsMode = FALSE;

						if(OFInittingTOCounter)
						{
							OFInittingTOCounter = 0;
							OFInitError -= 4;
						}
					}
					else
					{
						if(OFInitting)
						{
							if(!OFInittingTOCounter)
							{
								OFInittingTOCounter = InittingTO;
								OFInitError += 4;
							}
						}
					}
				}
				break;
			case 5:	// Open the bag (Step 2)& Ready the vibrator
				OFGatePneuValve	= FALSE;
				OFEngagePneuValve = FALSE;		// Open the bag further
				OFOpenPneuValve = FALSE;

