Aquawhite/LM3S5R31-TwinWeigher/New Twin Weigher V1.0.c
				VFVibEngagePneuValve = TRUE;	// Engage the Vibrator
				VFVibrator = FALSE;
				if( (!OFEngagePneuRetSensor) && (!VFVibEngagePneuExtSensor))
				{
					OFVacuumValve = FALSE;
					if(!OFSbsMode)
						OFModuleStep = 6;
					else
						OFSbsMode = FALSE;

					if(OFInittingTOCounter)
					{
						OFInittingTOCounter = 0;
						OFInitError -= 8;
					}
				}
				else
				{
					if(OFInitting)
					{
						if(!OFInittingTOCounter)
						{
							OFInittingTOCounter = InittingTO;
							OFInitError += 8;
						}
					}
				}
				break;
			case 6:	// Open the BRIDGE to initiate FILLING PROCESS
				if(GTRequestFilling || MachineStopping || OFInitting)
				{
					OFGatePneuValve	= TRUE;			// Thrust the Gate Tongue
					OFEngagePneuValve = FALSE;
					OFOpenPneuValve = FALSE;
					OFVacuumValve = FALSE;
					VFVibEngagePneuValve = TRUE;
					VFVibrator = FALSE;
					if(!OFGatePneuExtSensor)
					{
						if(!OFSbsMode)
							OFModuleStep = 7;
						else
							OFSbsMode = FALSE;

						if(OFInittingTOCounter)
						{
							OFInittingTOCounter = 0;
							OFInitError -= 16;
						}
					}
					else
					{
						if(OFInitting)
						{
							if(!OFInittingTOCounter)
							{
								OFInittingTOCounter = InittingTO;
								OFInitError += 16;
							}
						}
					}
				}
				break;
			case 7:	// Start FILLING when weigher module READY
				if(MachineStopping || OFInitting)
				{
					OFModuleStep = 8;
				}
				if(WLCLWeightOK || WLCRWeightOK)
				{
					OFRequestFilling = TRUE;
					VFVibrator = TRUE;				// Start Vibrating
					if(!OFSbsMode)
						OFModuleStep = 8;
					else
						OFSbsMode = FALSE;
				}
				break;
			case 8:	// Close the gate after finished & Stop Vibrating, tell GT to continue
				if( (!OFGatePneuValveDurationCounter) && (!WLOpGatePneuDurationCounter) && (!WROpGatePneuDurationCounter) )
				{
					GTRequestFilling = FALSE;			// Finished Filling, tell GT to continue

					OFGatePneuValve	= FALSE;			// Close the gate
					OFEngagePneuValve = FALSE;
					OFOpenPneuValve = FALSE;
					OFVacuumValve = FALSE;
					VFVibEngagePneuValve = FALSE;
					VFVibrator = FALSE;					// Stop Vibrating
					if( (!OFGatePneuRetSensor) && (!VFVibEngagePneuRetSensor) )
					{
						//OFGatePneuFilled = FALSE;
						if(!OFSbsMode)
							OFModuleStep = 9;
						else
							OFSbsMode = FALSE;

						if(OFInittingTOCounter)
						{
							OFInittingTOCounter = 0;
							OFInitError -= 32;
						}
					}
					else
					{
						if(OFInitting)
						{
							if(!OFInittingTOCounter)
							{
								OFInittingTOCounter = InittingTO;
								OFInitError += 32;
							}
						}
					}
				}
				break;
			case 9:	// back to module step 0
				OFGatePneuValve	= FALSE;
				OFEngagePneuValve = FALSE;
				OFOpenPneuValve = FALSE;
				OFVacuumValve = FALSE;
				VFVibEngagePneuValve = FALSE;
				VFVibrator = FALSE;
				OFModMode = FALSE;
				OFInitting = FALSE;
				if(!OFSbsMode)
					OFModuleStep = 0;
				else
					OFSbsMode = FALSE;
				break;
		}
	}

	if(OFVacuumValveDelayCounter)
		OFVacuumValveDelayCounter--;

	if(OFInittingTOCounter)
	{
		OFInittingTOCounter--;
		if(!OFInittingTOCounter)
			OFModuleStep++;
	}
	/* Filling Module ^ */

	/* Sealing Module v */
	if(MachineRunning || SPSbsMode || SPModMode || SPInitting)
	{
		switch(SPModuleStep)
		{
			case 0: // Standby
				//SPSealerPneuValve		= FALSE; 	// Sealer Opened
				SPVibEngagePneuValve	= FALSE;	// Vibrator Disengaged
				SPPusherValve			= TRUE;		// Pusher Extended
				SPVibrator				= FALSE;	// Vibrator OFF

				if( (MachineRunning && (!MachineStopping)) || SPInitting )
				{
					if( (!SPVibEngagePneuRetSensor) && (!SPSealerPneuRetSensor) && (!SPPusherPneuExtSensor))
					{
						if(!SPSbsMode)
							SPModuleStep = 1;
						else
							SPSbsMode = FALSE;

						if(SPInittingTOCounter)
						{
							SPInittingTOCounter = 0;
							SPInitError -= 1;
						}
					}
					else
					{
						if(SPInitting)
						{
							if(!SPInittingTOCounter)
							{
								SPInittingTOCounter = InittingTO;
								SPInitError += 1;
							}
						}
					}
				}
				break;
			case 1: // Bag from GT is in Place
				if(GTSA2ModuleWaiting || MachineStopping || SPInitting)
				{
					SPSealerPneuValveDelayCounter = SPSealerPneuValveDelay + 1;	// Sealer controlled by timing
					//SPSealerPneuValve		= TRUE; 	// Sealer Closed
					SPVibEngagePneuValve	= FALSE;
					SPPusherValve			= FALSE;	// Pusher Retracted so VibEngage can be ext
					SPVibrator				= FALSE;
					if(!SPPusherPneuRetSensor)
					{
						GTSA2ModuleWaiting 		= FALSE;			// Tell GT Module SA 2 to continue
						if(!SPSbsMode)
							SPModuleStep = 2;
						else
							SPSbsMode = FALSE;

						if(SPInittingTOCounter)
						{
							SPInittingTOCounter = 0;
							SPInitError -= 2;
						}
					}
					else
					{
						if(SPInitting)
						{
							if(!SPInittingTOCounter)
							{
								SPInittingTOCounter = InittingTO;
								SPInitError += 2;
							}
						}
					}
				}
				break;
			case 2:	// Engage the vibrator
				//SPSealerPneuValve		= TRUE; 	// Sealer still Closed
				SPVibEngagePneuValve	= TRUE;		// Start engaging
				SPPusherValve			= FALSE;
				SPVibrator				= FALSE;
				if(!SPVibEngagePneuExtSensor)
				{
					if(!SPSbsMode)
						SPModuleStep = 3;
					else
						SPSbsMode = FALSE;

					if(SPInittingTOCounter)
					{
						SPInittingTOCounter = 0;
						SPInitError -= 4;
					}
				}
				else
				{
					if(SPInitting)
					{
						if(!SPInittingTOCounter)
						{
							SPInittingTOCounter = InittingTO;
							SPInitError += 4;
						}
					}
				}
				break;
			case 3: // Vibrate
				//SPSealerPneuValve		= TRUE; 	// Sealer still Closed
				SPVibEngagePneuValve	= TRUE;
				SPPusherValve			= FALSE;
				SPVibrator				= TRUE;		// Vibrator ON
				if(!SPSbsMode)
					SPModuleStep = 4;
				else
					SPSbsMode = FALSE;
				break;
			case 4: // Open Sealer & Turn Off Vibrator
				//SPSealerPneuValve		= FALSE; 	// Start Opening
				SPVibEngagePneuValve	= TRUE;
				SPPusherValve			= FALSE;
				SPVibrator				= FALSE;	// Vibrator OFF
				if(!SPSealerPneuRetSensor)
				{
					if(!SPSbsMode)
						SPModuleStep = 5;
					else
						SPSbsMode = FALSE;

					if(SPInittingTOCounter)
					{
						SPInittingTOCounter = 0;
						SPInitError -= 8;
					}
				}
				else
				{
					if(SPInitting)
					{
						if(!SPInittingTOCounter)
						{
							SPInittingTOCounter = InittingTO;
							SPInitError += 8;
						}
					}
				}
				break;
			case 5: // Bring the VibEngagePneu down with the bag
				//SPSealerPneuValve		= FALSE; 	// Sealer Opened
				SPVibEngagePneuValve	= FALSE;	// Start disengaging
				SPPusherValve			= FALSE;
				SPVibrator				= FALSE;	// Vibrator OFF
				if(!SPVibEngagePneuRetSensor)
				{
					if(!SPSbsMode)
						SPModuleStep = 6;
					else
						SPSbsMode = FALSE;

					if(SPInittingTOCounter)
					{
						SPInittingTOCounter = 0;
						SPInitError -= 16;
					}
				}
				else
				{
					if(SPInitting)
					{
						if(!SPInittingTOCounter)
						{
							SPInittingTOCounter = InittingTO;
							SPInitError += 16;
						}
					}
				}
				break;
			case 6: // Push the bag out to conveyor
				//SPSealerPneuValve		= FALSE;
				SPVibEngagePneuValve	= FALSE;	// Vib is disengaged
				SPPusherValve			= TRUE;		// Pusher start pushing
				SPVibrator				= FALSE;	// Vibrator OFF
				if(!SPPusherPneuExtSensor)
				{
					if(!SPSbsMode)
						SPModuleStep = 7;
					else
						SPSbsMode = FALSE;

					if(SPInittingTOCounter)
					{
						SPInittingTOCounter = 0;
						SPInitError -= 32;
					}
				}
				else
				{
					if(SPInitting)
					{
						if(!SPInittingTOCounter)
						{
							SPInittingTOCounter = InittingTO;
							SPInitError += 32;
						}
					}
				}
				break;
			case 7:  // back to standby position
				SPModuleStep = 0;
				// Step 0
				SPVibEngagePneuValve	= FALSE;	// Vibrator Disengaged
				SPPusherValve			= TRUE;		// Pusher Extended
				SPVibrator				= FALSE;	// Vibrator OFF
				SPModMode = FALSE;
				SPInitting = FALSE;
				break;
		}
	}

	if(SPSealerPneuValveDelayCounter)
	{
		SPSealerPneuValveDelayCounter--;
		if(!SPSealerPneuValveDelayCounter)
		{
			SPSealerPneuValveDurationCounter = SPSealerPneuValveDuration;
		}
	}
	if(SPSealerPneuValveDurationCounter)
	{
		SPSealerPneuValveDurationCounter--;
		SPSealerPneuValve = TRUE;
		if(!SPSealerPneuValveDurationCounter)
		{

