Aquawhite/LM3S5R31-TwinWeigher/New Twin Weigher V1.0.c
		    // Unfortunately, in StellarisWare, UARTEnable() silently re-enables the FIFO,
		    // so to get rid of that, move UARTFIFODisable() call after UARTEnable()
		    UARTFIFODisable(UART0_BASE);
			dataTXIndex = ComAddress * 20;
			dataRXIndex = 0;
			UARTDisabled = FALSE;
			UARTDisabledCounter++;
			ReadACK = FALSE;
		}

		/* Error Message for HMI Subroutine v */
		if(HeaterErrorMsgDuration)
		{
			HeaterErrorMsgDuration--;
			HeaterErrorMsg = TRUE;
		}
		else
			HeaterErrorMsg = FALSE;

		if(FoilJamMsgDuration)
		{
			FoilJamMsgDuration--;
			FoilJamMsg = TRUE;
		}
		else
			FoilJamMsg = FALSE;

		if(NoAirErrorMsgDuration)
		{
			NoAirErrorMsgDuration--;
			NoAirErrorMsg = TRUE;
		}
		else
			NoAirErrorMsg = FALSE;
		/* Error Message for HMI Subroutine ^ */

		ms100counter = 99;

	}
	else
		ms100counter--;
}

//*****************************************************************************
// Interrupt handler for the Timer0 interrupt
//*****************************************************************************
void Timer1IntHandler(void)
{
    //unsigned long ulPinStaRaya Kupang Baru No.62, Suko Manunggal, Kota Surabaya, Jawa Timur 60189tus;

    // Clear the timer interrupt.
    TimerIntClear(TIMER1_BASE, TIMER_TIMA_TIMEOUT);

    if(ReadACK)
    {
		if(DataTimerTrigger)
		{
			if(DataReady)
			{
				DataLock = TRUE;
				/*while( dataTXIndex <= ((ComAddress * 20) + (BytestoRead) + 5 - 1) )
				{
					ROM_UARTCharPut(UART0_BASE, ComOUT[dataTXIndex]);
					dataTXIndex++;
				}
				DataTimerCounter++;
				DataLock = FALSE;
				ReadACK = FALSE;
				dataTXIndex = ComAddress * 20;*/
				if(ROM_UARTSpaceAvail(UART0_BASE))
				{
					ROM_UARTCharPutNonBlocking(UART0_BASE, ComOUT[dataTXIndex]);
					if( dataTXIndex == ((ComAddress * 20) + (BytestoRead) + 5 - 1) )
					{
						DataLock = FALSE;
						ReadACK = FALSE;
						dataTXIndex = 0;
					}
					else
						dataTXIndex++;

					DataTimerTrigger = FALSE;
				}
				else
					DataTimerTrigger = TRUE;


			}
			DataTimerCounter++;
		}
    }

    // Loadcell Communication v
	if(!WLCLWaitingMode)
	{
		if( ROM_GPIOPinRead(PORT_W_LCL_SCL_BASE, PORT_W_LCL_SCL_PIN) )
		{
			if(WLCLSCLCounter < 24)
				if( ROM_GPIOPinRead(PIN_W_LCL_DATA_BASE, PIN_W_LCL_DATA_PIN) )
					WLCLSDAReadingTemp = (WLCLSDAReadingTemp << 1) + 1;
				else
					WLCLSDAReadingTemp = WLCLSDAReadingTemp << 1;

			ROM_GPIOPinWrite(PORT_W_LCL_SCL_BASE, PORT_W_LCL_SCL_PIN, 0);//PORTSCL = FALSE;

			WLCLSCLCounter++;
		}
		else
			ROM_GPIOPinWrite(PORT_W_LCL_SCL_BASE, PORT_W_LCL_SCL_PIN, PORT_W_LCL_SCL_PIN);

		if(WLCLSCLCounter > 23)
		{
			WLCLSCLCounter = 0;
			WLCLSDAReading = WLCLSDAReadingTemp;
			WLCLSDAReadingBuffer[WLCLSDAAverageCounter] = WLCLSDAReading;
			WLCLSDAAverageCounter++;
			if(WLCLSDAAverageCounter >= WLCLLoadSampling)
				WLCLSDAAverageCounter = 0;

			WLCLSDAReadingTemp = 0;                                                 // SDAReadingTemp must be cleared first before receiving new data
			WLCLWaitingMode = TRUE;
		}
	}

	if(!WLCRWaitingMode)
	{
		if( ROM_GPIOPinRead(PORT_W_LCR_SCL_BASE, PORT_W_LCR_SCL_PIN) )
		{
			if(WLCRSCLCounter < 24)
				if( ROM_GPIOPinRead(PIN_W_LCR_DATA_BASE, PIN_W_LCR_DATA_PIN) )
					WLCRSDAReadingTemp = (WLCRSDAReadingTemp << 1) + 1;
				else
					WLCRSDAReadingTemp = WLCRSDAReadingTemp << 1;

			ROM_GPIOPinWrite(PORT_W_LCR_SCL_BASE, PORT_W_LCR_SCL_PIN, 0);//PORTSCL = FALSE;

			WLCRSCLCounter++;
		}
		else
			ROM_GPIOPinWrite(PORT_W_LCR_SCL_BASE, PORT_W_LCR_SCL_PIN, PORT_W_LCR_SCL_PIN);

		if(WLCRSCLCounter > 23)
		{
			WLCRSCLCounter = 0;
			WLCRSDAReading = WLCRSDAReadingTemp;
			WLCRSDAReadingBuffer[WLCRSDAAverageCounter] = WLCRSDAReading;
			WLCRSDAAverageCounter++;
			if(WLCRSDAAverageCounter >= WLCRLoadSampling)
				WLCRSDAAverageCounter = 0;

			WLCRSDAReadingTemp = 0;                                                 // SDAReadingTemp must be cleared first before receiving new data
			WLCRWaitingMode = TRUE;
		}
	}
	// Loadcell Communication ^
}

int
main(void)
{

    // Set the system clock 80MHz
    ROM_SysCtlClockSet(SYSCTL_SYSDIV_2_5 | SYSCTL_USE_PLL | SYSCTL_OSC_MAIN |
                       SYSCTL_XTAL_16MHZ);

    ROM_SysCtlPeripheralEnable (SYSCTL_PERIPH_GPIOA);
    ROM_SysCtlPeripheralEnable (SYSCTL_PERIPH_GPIOB);
    ROM_SysCtlPeripheralEnable (SYSCTL_PERIPH_GPIOC);
    ROM_SysCtlPeripheralEnable (SYSCTL_PERIPH_GPIOD);
    ROM_SysCtlPeripheralEnable (SYSCTL_PERIPH_GPIOE);
    ROM_SysCtlPeripheralEnable (SYSCTL_PERIPH_GPIOF);
    ROM_SysCtlPeripheralEnable (SYSCTL_PERIPH_GPIOG);
    ROM_SysCtlPeripheralEnable (SYSCTL_PERIPH_GPIOH);
    ROM_SysCtlPeripheralEnable (SYSCTL_PERIPH_GPIOJ);
    ROM_SysCtlPeripheralEnable (SYSCTL_PERIPH_TIMER0);
    ROM_SysCtlPeripheralEnable (SYSCTL_PERIPH_TIMER1);
    //ROM_SysCtlPeripheralEnable (SYSCTL_PERIPH_QEI0);
    ROM_SysCtlPeripheralEnable (SYSCTL_PERIPH_SSI0);
    ROM_SysCtlPeripheralEnable (SYSCTL_PERIPH_UART0);
    //ROM_SysCtlPeripheralEnable (SYSCTL_PERIPH_I2C1);

	// Change PB7 into GPIO outputs. First open the lock and select
	// the bits we want to modify in the GPIO commit register.
	//
	HWREG(GPIO_PORTB_BASE + GPIO_O_LOCK) = GPIO_LOCK_KEY_DD;
	HWREG(GPIO_PORTB_BASE + GPIO_O_CR) = 0x80;

	HWREG(GPIO_PORTF_BASE + GPIO_O_LOCK) = GPIO_LOCK_KEY_DD;
	HWREG(GPIO_PORTF_BASE + GPIO_O_CR) = 0x10;

	HWREG(GPIO_PORTF_BASE + GPIO_O_LOCK) = GPIO_LOCK_KEY_DD;
	HWREG(GPIO_PORTF_BASE + GPIO_O_CR) = 0x20;

    // Initialize the GPIO
    ROM_GPIOPinTypeGPIOInput (GPIO_PORTA_BASE, 0x11);
    ROM_GPIOPinTypeGPIOOutput(GPIO_PORTA_BASE, 0xEE);

    ROM_GPIOPinTypeGPIOInput (GPIO_PORTB_BASE, 0xFB);
    ROM_GPIOPinTypeGPIOOutput(GPIO_PORTB_BASE, 0x04);

    ROM_GPIOPinTypeGPIOOutput (GPIO_PORTC_BASE, 0xF0);

    ROM_GPIOPinTypeGPIOInput (GPIO_PORTD_BASE, 0xFE);
    ROM_GPIOPinTypeGPIOOutput(GPIO_PORTD_BASE, 0x01);

    ROM_GPIOPinTypeGPIOInput (GPIO_PORTE_BASE, 0xDC);
    ROM_GPIOPinTypeGPIOOutput(GPIO_PORTE_BASE, 0x23);

    ROM_GPIOPinTypeGPIOInput (GPIO_PORTF_BASE, 0x07);
    ROM_GPIOPinTypeGPIOOutput(GPIO_PORTF_BASE, 0x38);

    ROM_GPIOPinTypeGPIOOutput(GPIO_PORTG_BASE, 0x83);

    ROM_GPIOPinTypeGPIOInput(GPIO_PORTH_BASE, 0x7F);
    ROM_GPIOPinTypeGPIOOutput(GPIO_PORTH_BASE, 0x80);

