Aquawhite/LM3S5R31-TwinWeigher/New Twin Weigher V1.0.c
        }*/
        // Output to OF Module when there is request
        if(WLCRWeightOK || WLCLWeightOK)
        {
        	if(OFRequestFilling)
        	{
				if(WLCLWeightOK)
				   WLOpGatePneuDurationCounter = WLOpGatePneuDuration;
				else if(WLCRWeightOK)
				   WROpGatePneuDurationCounter = WROpGatePneuDuration;

				OFRequestFilling = FALSE;
        	}
        }
        /* Weigher Module Operation Program ^ */

        /* Control Program v */
        if((!ServiceMode) && (ComFlag))                                                                               // Operation Page (Not Service Mode)
        {
            if(!MachineRunning)                                                                             // when machine is not running
            {
                if( RunBtn ) // (!PINBTNRUN)
                {

					TRSbsMode = FALSE;
					GTSbsMode = FALSE;
					OFSbsMode = FALSE;
					SPSbsMode = FALSE;
					MachineRunning = TRUE;
					WLCLWeightOKCounter = 200;
					WLCRWeightOKCounter = 200;
					if( (!TRModuleStep) && (!GTModuleStep) && (!OFModuleStep) && (!SPModuleStep) )
					{
						TRModuleWaiting = FALSE;
						GTSA1ModuleWaiting = FALSE;
						GTSA2ModuleWaiting = FALSE;
						OFModuleWaiting = FALSE;
						GTRequestFilling = FALSE;
					}

                	RunBtn = FALSE;
                }
                if( InitMON )
                {
                	if(!Initting)
                	{
						Initting = TRUE;
						TRInitting = TRUE;
						GTInitting = TRUE;
						OFInitting = TRUE;
						SPInitting = TRUE;
						TRInitError = 0;
						GTInitError = 0;
						OFInitError = 0;
						SPInitError = 0;
                	}
                	InitMON = FALSE;
                }
            }
            else                                                                                                    // when machine is RUNNING
            {
                if( StopBtn ) //|| Error)         // Motor OFF Btn/Inching pushed or Error Triggered
                {
                	MachineStopping = TRUE;
                	WLLrGatePneuValve = FALSE;
					WLSmGatePneuValve = FALSE;
					WRLrGatePneuValve = FALSE;
					WRSmGatePneuValve = FALSE;
                	WLCLWeightOK = FALSE;
                	WLCRWeightOK = FALSE;
                	StopBtn = FALSE;
                	/*
                    if(StopCommand == FALSE)                                              // Stop the machine at designated STOP AT position
                    {
                        StopCommand = TRUE;
                    }*/
                }
                if(FatalError)
                {
                    MachineRunning = FALSE;
                }
            }
        }
        if(Initting)
        {
        	if( (!TRInitting) && (!GTInitting) && (!OFInitting) && (!SPInitting) )
        	{
        		Initting = FALSE;
        		GTSA1ModuleWaiting = FALSE;
        		GTSA2ModuleWaiting = FALSE;
        		OFModuleWaiting = FALSE;
        		TRModuleWaiting = FALSE;
        		TRInitErrorResult = TRInitError;
        		GTInitErrorResult = GTInitError;
        		OFInitErrorResult = OFInitError;
        		SPInitErrorResult = SPInitError;
        		GTFirstCycle = TRUE;
        	}
        }
        if(MachineStopping)
        {
        	if( (!TRModuleStep) && (!GTModuleStep) && (!OFModuleStep) && (!SPModuleStep) )
        	{
        		MachineStopping = FALSE;
        		MachineRunning = FALSE;
        		GTSA1ModuleWaiting = FALSE;
        		GTSA2ModuleWaiting = FALSE;
        		OFModuleWaiting = FALSE;
        		TRModuleWaiting = FALSE;
        		GTFirstCycle = TRUE;
        	}
        }

        //FoilSub();                                                                        // Motor Foil Subroutine
        /* Control Program ^ */

        /* Error Identifier v */

        if(NoAirError)
            FatalError = TRUE;
        else
            FatalError = FALSE;

        if(HeaterError || DoorOpen || FoilEmpty )
            Error = TRUE;
        else
            Error = FALSE;

        /* Error Identifier ^ */

        /* Error Handler v */

        if(Error || FatalError || HeaterErrorMsg || FoilJamMsg || NoAirErrorMsg)
        {
            if(blinkFlag)                           // Warning, took DoorOpen place in com
                BlinkCom = TRUE;
            else
                BlinkCom = FALSE;
        }
        else
            BlinkCom = FALSE;

        /* Error Handler ^ */
        if(ReadACK)
        {
            if(DataReady)
            {
                DataLock = TRUE;
				while( dataTXIndex <= ((ComAddress * 20) + (BytestoRead) + 5 - 1) )
				{
					ROM_UARTCharPut(UART0_BASE, ComOUT[dataTXIndex]);
					dataTXIndex++;
				}
				DataLock = FALSE;
				ReadACK = FALSE;
				dataTXIndex = ComAddress * 20;
            }
            else
                DataTimerTrigger = TRUE;                        // Activate the transfer manually
        }

    	// UART Communication Subroutine
        if(DataLock == FALSE)
        {   //Init Page ComOUT[0] - ComOUT[19]
            DataReady = FALSE;
            ComOUT[0]= 0xF0;              // Start
            // OUT: Position: Station No = 0
            ComOUT[1]= 0x01;
            // OUT: Function: Number 3
            ComOUT[2]= 0x03;
            // OUT : END
            ComOUT[3] = 0x0F;
            ComOUT[4] = 0x0F;

            //Main Page ComOUT[20] - ComOUT[39]
            ComOUT[20] = 0xF0;              // Start
            // OUT: Position: Station No = 0
            ComOUT[21] = 0x01;
            // OUT: Function: Number 3
            ComOUT[22] = 0x03;
            // OUT: Data
            ComOUT[23] = MachineRunning + (BlinkCom << 1) + (ProductCountBit << 2) + (GTFirstCycle << 3) + (MachineStopping << 4) + (Initting << 5);
            ComOUT[24] = HeaterErrorMsg + (EyemarkError << 1) + (DoorOpen << 2) + (SPIComError << 3) + (NoAirErrorMsg << 4)  + (DatesensError << 5);
            ComOUT[25] = ITMotorTrayElevator + (ITMotorTrayElevatorDir << 1) + (ITValveTrayPos << 2) + (ITReady << 3);
            ComOUT[26] = TRExtenderPneuValve + (TRReorientPneuValve << 1) + (TRVacuumValve << 2) + (GTFPushPneuValve << 3) + (TRModuleWaiting << 4);
            ComOUT[27] = GTInFillGripPneuValve + (GTOutFillOpenPneuValve << 1) + (GTOutFillGripPneuValve << 2) + (GTTransferPneuValve << 3) + (GTSA1ModuleWaiting << 4) + (GTSA2ModuleWaiting << 5) + (GTRequestFilling << 6);
            ComOUT[28] = OFGatePneuValve + (OFEngagePneuValve << 1) + (OFOpenPneuValve << 2) + (OFVacuumValve << 3) + (VFVibEngagePneuValve << 4) + (VFVibrator << 5) + (OFGatePneuFilled << 6) + (OFGatePneuFillingProcess << 7);
            ComOUT[29] = OFModuleWaiting;
            ComOUT[30] = SPSealerPneuValve + (SPVibEngagePneuValve << 1) + (SPPusherValve << 2) + (SPVibrator << 3) + (WLCLWeightOK << 6) + (WLCRWeightOK << 7);
            ComOUT[31] = WLLrGatePneuValve + (WLSmGatePneuValve << 1) + (WLOpGatePneuValve << 2) + (WRLrGatePneuValve << 3) + (WRSmGatePneuValve << 4) + (WROpGatePneuValve << 5) + (WLCLCalibrationFlag << 6) + (WLCRCalibrationFlag << 7);
            // All Pins Master
            ComOUT[32] = ROM_GPIOPinRead(GPIO_PORTA_BASE, 0xFF);
            ComOUT[33] = ROM_GPIOPinRead(GPIO_PORTB_BASE, 0xFF);
            ComOUT[34] = ROM_GPIOPinRead(GPIO_PORTC_BASE, 0xFF);
            ComOUT[35] = ROM_GPIOPinRead(GPIO_PORTD_BASE, 0xFF);
            ComOUT[36] = ROM_GPIOPinRead(GPIO_PORTE_BASE, 0xFF);
            ComOUT[37] = ROM_GPIOPinRead(GPIO_PORTF_BASE, 0xFF);
            ComOUT[38] = ROM_GPIOPinRead(GPIO_PORTG_BASE, 0xFF);
            ComOUT[39] = ROM_GPIOPinRead(GPIO_PORTH_BASE, 0xFF);
            ComOUT[41] = ROM_GPIOPinRead(GPIO_PORTJ_BASE, 0xFF);
            // All Pins Slave
            ComOUT[42] = SlavePortA;
            ComOUT[43] = SlavePortB;
            ComOUT[44] = SlavePortC;
            ComOUT[45] = SlavePortD;
            ComOUT[46] = SlavePortE;
            ComOUT[47] = SlavePortF;
            ComOUT[48] = SlavePortG;
            ComOUT[49] = SlavePortH;
            ComOUT[50] = SlavePortI;
            ComOUT[51] = SlavePortJ;

